version_one_abandoned/app/controllers/games_controller.rb

  def create
    @game = Game.new(game_params)

    respond_to do |format|
      if @game.save
---
INSERT INTO "games" ("created_at", "date", "updated_at") VALUES (?, ?, ?)  [["created_at", Thu, 29 May 2014 04:55:57 UTC +00:00], ["date", Wed, 28 May 2014], ["updated_at", Thu, 29 May 2014 04:55:57 UTC +00:00]]