app/controllers/players_controller.rb

INSERT INTO "players" ("created_at", "name", "pro", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 28 May 2014 08:50:22 UTC +00:00], ["name", "Johnny Test"], ["pro", false], ["updated_at", Wed, 28 May 2014 08:50:22 UTC +00:00]]
---
  def create
    @player = Player.new(player_params)

    respond_to do |format|
      if @player.save